Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions
The value precisions for the dimensions.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.Whole
The value is rounded to the nearest whole (1).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerTwo
The value is rounded to the nearest half (1/2).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerThree
The value is rounded to the nearest third (1/3).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerFour
The value is rounded to the nearest fourth (1/4).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerEight
The value is rounded to the nearest eighth (1/8).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerSixteen
The value is rounded to the nearest sixteenth (1/16).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerThirtytwo
The value is rounded to the nearest thirtysecond (1/32).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerTen
The value is rounded to one decimal (1/10).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerHundred
The value is rounded to two decimals (1/100).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.OnePerThousand
The value is rounded to three decimals (1/1000).

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.TwoAndHalfPerOne
Value is rounded to nearest 2.5mm

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.FivePerOne
Value is rounded to nearest 5mm

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionValuePrecisions.TenPerOne
Value is rounded to nearest 10mm